TMS320C6x Assembler PC v7.4.18 Mon Oct 30 11:20:42 2023

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Lenovo\AppData\Local\Temp\1988010                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                         PC v7.4.18 *
       3                    ;* Date/Time created: Mon Oct 30 11:20:42 2023                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=coffabi --c64p_l1d_workaround=default --endian=little --hll_source=on --l
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C670x                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    1637 00000764 00002000             NOP             2
    1638 00000768           $C$RL32:   ; CALL OCCURS {_MCBSP_read} {0}   ; |105| 
    1639 00000768 0200002A-            MVKL    .S2     _AIC_data,B4
    1640 0000076c 0200006A-            MVKH    .S2     _AIC_data,B4
    1641 00000770 021002F4             STW     .D2T1   A4,*B4            ; |105| 
    1642                            .dwpsn  file "../c6713dskinit.c",line 106,column 2,is_stmt
    1643 00000774 01901058             MV      .L1X    B4,A3
    1644 00000778 020C0244             LDH     .D1T1   *A3,A4            ; |106| 
    1645 0000077c 00006000             NOP             4
    1646                            .dwpsn  file "../c6713dskinit.c",line 107,column 1,is_stmt
    1647 00000780 01BC52E6             LDW     .D2T2   *++SP(8),B3       ; |107| 
    1648 00000784 00006000             NOP             4
    1649                            .dwcfi  cfa_offset, 0
    1650                            .dwcfi  restore_reg, 19
TMS320C6x Assembler PC v7.4.18 Mon Oct 30 11:20:42 2023

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Lenovo\AppData\Local\Temp\1988010                           PAGE   31

    1651                            .dwcfi  cfa_offset, 0
    1652                    $C$DW$112       .dwtag  DW_TAG_TI_branch
    1653                            .dwattr $C$DW$112, DW_AT_low_pc(0x00)
    1654                            .dwattr $C$DW$112, DW_AT_TI_return
    1655 00000788 000C0362             RET     .S2     B3                ; |107| 
    1656 0000078c 00008000             NOP             5
    1657                               ; BRANCH OCCURS {B3}              ; |107| 
    1658                    
    1659                    $C$DW$113       .dwtag  DW_TAG_TI_loop
    1660                            .dwattr $C$DW$113, DW_AT_name("C:\\Users\\Lenovo\\AppData\\Local\\Temp\\1988010:$C$L11:1:16986
    1661                            .dwattr $C$DW$113, DW_AT_TI_begin_file("../c6713dskinit.c")
    1662                            .dwattr $C$DW$113, DW_AT_TI_begin_line(0x68)
    1663                            .dwattr $C$DW$113, DW_AT_TI_end_line(0x68)
    1664                    $C$DW$114       .dwtag  DW_TAG_TI_loop_range
    1665                            .dwattr $C$DW$114, DW_AT_low_pc($C$DW$L$_input_right_sample$3$B)
    1666                            .dwattr $C$DW$114, DW_AT_high_pc($C$DW$L$_input_right_sample$3$E)
    1667                            .dwendtag $C$DW$113
    1668                    
    1669                            .dwattr $C$DW$108, DW_AT_TI_end_file("../c6713dskinit.c")
    1670                            .dwattr $C$DW$108, DW_AT_TI_end_line(0x6b)
    1671                            .dwattr $C$DW$108, DW_AT_TI_end_column(0x01)
    1672                            .dwendentry
    1673                            .dwendtag $C$DW$108
    1674                    
    1675                    ;*****************************************************************************
    1676                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1677                    ;*****************************************************************************
    1678                            .global _IRQ_map
    1679                            .global _IRQ_enable
    1680                            .global _IRQ_reset
    1681                            .global _IRQ_globalEnable
    1682                            .global _IRQ_globalDisable
    1683                            .global _IRQ_nmiEnable
    1684                            .global _DSK6713_init
    1685                            .global _MCBSP_start
    1686                            .global _MCBSP_getXmtEventId
    1687                            .global _MCBSP_read
    1688                            .global _MCBSP_write
    1689                            .global _MCBSP_xrdy
    1690                            .global _MCBSP_rrdy
    1691                            .global _MCBSP_config
    1692                            .global _DSK6713_AIC23_openCodec
    1693                            .global _DSK6713_AIC23_setFreq
    1694                            .global _DSK6713_AIC23_codecdatahandle
    1695                            .global _fs
    1696                    
    1697                    ;******************************************************************************
    1698                    ;* BUILD ATTRIBUTES                                                           *
    1699                    ;******************************************************************************
    1700                            .battr "TI", Tag_File, 1, Tag_ABI_stack_align_needed(0)
    1701                            .battr "TI", Tag_File, 1, Tag_ABI_stack_align_preserved(0)
    1702                            .battr "TI", Tag_File, 1, Tag_Tramps_Use_SOC(0)
    1703                    
    1704                    ;******************************************************************************
    1705                    ;* TYPE INFORMATION                                                           *
TMS320C6x Assembler PC v7.4.18 Mon Oct 30 11:20:42 2023

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Lenovo\AppData\Local\Temp\1988010                           PAGE   32

    1706                    ;******************************************************************************
    1707                    
    1708                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1709                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
    1710                    $C$DW$115       .dwtag  DW_TAG_member
    1711                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1712                            .dwattr $C$DW$115, DW_AT_name("allocated")
    1713                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("_allocated")
    1714                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1716                    $C$DW$116       .dwtag  DW_TAG_member
    1717                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1718                            .dwattr $C$DW$116, DW_AT_name("xmtEventId")
    1719                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("_xmtEventId")
    1720                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1721                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1722                    $C$DW$117       .dwtag  DW_TAG_member
    1723                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1724                            .dwattr $C$DW$117, DW_AT_name("rcvEventId")
    1725                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rcvEventId")
    1726                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1727                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1728                    $C$DW$118       .dwtag  DW_TAG_member
    1729                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1730                            .dwattr $C$DW$118, DW_AT_name("baseAddr")
    1731                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("_baseAddr")
    1732                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1733                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1734                    $C$DW$119       .dwtag  DW_TAG_member
    1735                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1736                            .dwattr $C$DW$119, DW_AT_name("drrAddr")
    1737                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("_drrAddr")
    1738                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1739                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1740                    $C$DW$120       .dwtag  DW_TAG_member
    1741                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1742                            .dwattr $C$DW$120, DW_AT_name("dxrAddr")
    1743                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("_dxrAddr")
    1744                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1745                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1746                            .dwendtag $C$DW$T$22
    1747                    
    1748                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1749                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    1750                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1751                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("MCBSP_Handle")
    1752                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1753                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1754                    
    1755                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1756                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    1757                    $C$DW$121       .dwtag  DW_TAG_member
    1758                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1759                            .dwattr $C$DW$121, DW_AT_name("spcr")
    1760                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("_spcr")
TMS320C6x Assembler PC v7.4.18 Mon Oct 30 11:20:42 2023

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Lenovo\AppData\Local\Temp\1988010                           PAGE   33

    1761                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1763                    $C$DW$122       .dwtag  DW_TAG_member
    1764                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1765                            .dwattr $C$DW$122, DW_AT_name("rcr")
    1766                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rcr")
    1767                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1768                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1769                    $C$DW$123       .dwtag  DW_TAG_member
    1770                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1771                            .dwattr $C$DW$123, DW_AT_name("xcr")
    1772                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("_xcr")
    1773                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1774                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1775                    $C$DW$124       .dwtag  DW_TAG_member
    1776                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1777                            .dwattr $C$DW$124, DW_AT_name("srgr")
    1778                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("_srgr")
    1779                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1780                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1781                    $C$DW$125       .dwtag  DW_TAG_member
    1782                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1783                            .dwattr $C$DW$125, DW_AT_name("mcr")
    1784                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("_mcr")
    1785                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1786                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1787                    $C$DW$126       .dwtag  DW_TAG_member
    1788                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1789                            .dwattr $C$DW$126, DW_AT_name("rcer")
    1790                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rcer")
    1791                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1792                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1793                    $C$DW$127       .dwtag  DW_TAG_member
    1794                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1795                            .dwattr $C$DW$127, DW_AT_name("xcer")
    1796                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("_xcer")
    1797                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1798                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1799                    $C$DW$128       .dwtag  DW_TAG_member
    1800                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1801                            .dwattr $C$DW$128, DW_AT_name("pcr")
    1802                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("_pcr")
    1803                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1804                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1805                            .dwendtag $C$DW$T$23
    1806                    
    1807                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("MCBSP_Config")
    1808                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$23)
    1809                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1810                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1811                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1812                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    1813                    
    1814                    $C$DW$T$25      .dwtag  DW_TAG_union_type
    1815                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
TMS320C6x Assembler PC v7.4.18 Mon Oct 30 11:20:42 2023

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Lenovo\AppData\Local\Temp\1988010                           PAGE   34

    1816                    $C$DW$129       .dwtag  DW_TAG_member
    1817                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1818                            .dwattr $C$DW$129, DW_AT_name("uint")
    1819                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("_uint")
    1820                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1822                    $C$DW$130       .dwtag  DW_TAG_member
    1823                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$24)
    1824                            .dwattr $C$DW$130, DW_AT_name("channel")
    1825                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("_channel")
    1826                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1828                            .dwendtag $C$DW$T$25
    1829                    
    1830                    
    1831                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1832                            .dwattr $C$DW$T$27, DW_AT_name("DSK6713_AIC23_Config")
    1833                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x28)
    1834                    $C$DW$131       .dwtag  DW_TAG_member
    1835                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$26)
    1836                            .dwattr $C$DW$131, DW_AT_name("regs")
    1837                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("_regs")
    1838                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1840                            .dwendtag $C$DW$T$27
    1841                    
    1842                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_Config")
    1843                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    1844                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1845                    $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1846                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1847                            .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    1848                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1849                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1850                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1851                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1852                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1853                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1854                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1855                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1856                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1857                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1858                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1859                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1860                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1861                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1862                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1863                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1864                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1865                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1866                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1867                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1868                    
    1869                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    1870                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$8)
TMS320C6x Assembler PC v7.4.18 Mon Oct 30 11:20:42 2023

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Lenovo\AppData\Local\Temp\1988010                           PAGE   35

    1871                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1872                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1873                    $C$DW$132       .dwtag  DW_TAG_subrange_type
    1874                            .dwattr $C$DW$132, DW_AT_upper_bound(0x01)
    1875                            .dwendtag $C$DW$T$24
    1876                    
    1877                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1878                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1879                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1880                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1881                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1882                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1883                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1884                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1885                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_CodecHandle")
    1886                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$10)
    1887                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1888                    
